{"class_name": "Functional", "config": {"name": "model_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 25, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "data_fast", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAgAAAAcAAABDAAAAcygAAAB8AGQAZACFAmQAZAB8AYUDZABkAIUCZABkAIUCZABk\nAIUCZgUZAFMAKQFOqQApAtoBeNoGc3RyaWRlcgEAAAByAQAAAHoePGlweXRob24taW5wdXQtOS0z\nMzJjYmJlNzY5ODc+2glkYXRhbGF5ZXIcAAAAcwIAAAAAAQ==\n", null, null], "function_type": "lambda", "module": "keras.layers.core", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {"stride": 2}}, "name": "data_fast", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "data_slow", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAgAAAAcAAABDAAAAcygAAAB8AGQAZACFAmQAZAB8AYUDZABkAIUCZABkAIUCZABk\nAIUCZgUZAFMAKQFOqQApAtoBeNoGc3RyaWRlcgEAAAByAQAAAHoePGlweXRob24taW5wdXQtOS0z\nMzJjYmJlNzY5ODc+2glkYXRhbGF5ZXIcAAAAcwIAAAAAAQ==\n", null, null], "function_type": "lambda", "module": "keras.layers.core", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {"stride": 16}}, "name": "data_slow", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_149", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 13, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv3d_221_input"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_221", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [5, 7, 7], "strides": [1, 2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_213", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_197", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_149", "inbound_nodes": [[["data_fast", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_186", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv3d_278_input"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_278", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 7, 7], "strides": [1, 2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_266", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_246", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_186", "inbound_nodes": [[["data_slow", 0, 0, {}]]]}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_5", "trainable": true, "dtype": "float32", "pool_size": [1, 3, 3], "padding": "same", "strides": [1, 2, 2], "data_format": "channels_last"}, "name": "max_pooling3d_5", "inbound_nodes": [[["sequential_149", 1, 0, {}]]]}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_6", "trainable": true, "dtype": "float32", "pool_size": [1, 3, 3], "padding": "same", "strides": [1, 2, 2], "data_format": "channels_last"}, "name": "max_pooling3d_6", "inbound_nodes": [[["sequential_186", 1, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_222", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [5, 1, 1], "strides": [8, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_222", "inbound_nodes": [[["max_pooling3d_5", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_11", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_11", "inbound_nodes": [[["max_pooling3d_6", 0, 0, {}], ["conv3d_222", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_151", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 13, 56, 56, 8], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv3d_224_input"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_224", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_215", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_198", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_151", "inbound_nodes": [[["max_pooling3d_5", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_188", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 56, 56, 80], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv3d_280_input"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_280", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_268", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_247", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_188", "inbound_nodes": [[["concatenate_11", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_152", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 13, 56, 56, 8], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv3d_225_input"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_225", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_216", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_199", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_152", "inbound_nodes": [[["sequential_151", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_189", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 56, 56, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv3d_281_input"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_281", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_269", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_248", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_189", "inbound_nodes": [[["sequential_188", 1, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_226", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_226", "inbound_nodes": [[["sequential_152", 1, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_282", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_282", "inbound_nodes": [[["sequential_189", 1, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_217", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_217", "inbound_nodes": [[["conv3d_226", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_150", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 13, 56, 56, 8], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv3d_223_input"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_223", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_214", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}]}, "name": "sequential_150", "inbound_nodes": [[["max_pooling3d_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_270", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_270", "inbound_nodes": [[["conv3d_282", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_187", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 56, 56, 80], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv3d_279_input"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_279", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_267", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}]}, "name": "sequential_187", "inbound_nodes": [[["concatenate_11", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_65", "trainable": true, "dtype": "float32"}, "name": "add_65", "inbound_nodes": [[["batch_normalization_217", 0, 0, {}], ["sequential_150", 1, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_81", "trainable": true, "dtype": "float32"}, "name": "add_81", "inbound_nodes": [[["batch_normalization_270", 0, 0, {}], ["sequential_187", 1, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_200", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_200", "inbound_nodes": [[["add_65", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_249", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_249", "inbound_nodes": [[["add_81", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_153", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 13, 56, 56, 32], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv3d_227_input"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_227", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_218", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_201", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_153", "inbound_nodes": [[["re_lu_200", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_190", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 56, 56, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv3d_283_input"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_283", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_271", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_250", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_190", "inbound_nodes": [[["re_lu_249", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_154", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 13, 56, 56, 8], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv3d_228_input"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_228", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_219", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_202", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_154", "inbound_nodes": [[["sequential_153", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_191", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 56, 56, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv3d_284_input"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_284", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_272", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_251", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_191", "inbound_nodes": [[["sequential_190", 1, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_229", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_229", "inbound_nodes": [[["sequential_154", 1, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_285", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_285", "inbound_nodes": [[["sequential_191", 1, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_220", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_220", "inbound_nodes": [[["conv3d_229", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_273", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_273", "inbound_nodes": [[["conv3d_285", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_66", "trainable": true, "dtype": "float32"}, "name": "add_66", "inbound_nodes": [[["batch_normalization_220", 0, 0, {}], ["re_lu_200", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_82", "trainable": true, "dtype": "float32"}, "name": "add_82", "inbound_nodes": [[["batch_normalization_273", 0, 0, {}], ["re_lu_249", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_203", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_203", "inbound_nodes": [[["add_66", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_252", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_252", "inbound_nodes": [[["add_82", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_155", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 13, 56, 56, 32], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv3d_230_input"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_230", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_221", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_204", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_155", "inbound_nodes": [[["re_lu_203", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_192", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 56, 56, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv3d_286_input"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_286", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_274", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_253", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_192", "inbound_nodes": [[["re_lu_252", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_156", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 13, 56, 56, 8], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv3d_231_input"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_231", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_222", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_205", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_156", "inbound_nodes": [[["sequential_155", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_193", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 56, 56, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv3d_287_input"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_287", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_275", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_254", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_193", "inbound_nodes": [[["sequential_192", 1, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_232", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_232", "inbound_nodes": [[["sequential_156", 1, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_288", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_288", "inbound_nodes": [[["sequential_193", 1, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_223", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_223", "inbound_nodes": [[["conv3d_232", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_276", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_276", "inbound_nodes": [[["conv3d_288", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_67", "trainable": true, "dtype": "float32"}, "name": "add_67", "inbound_nodes": [[["batch_normalization_223", 0, 0, {}], ["re_lu_203", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_83", "trainable": true, "dtype": "float32"}, "name": "add_83", "inbound_nodes": [[["batch_normalization_276", 0, 0, {}], ["re_lu_252", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_206", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_206", "inbound_nodes": [[["add_67", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_255", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_255", "inbound_nodes": [[["add_83", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_233", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 1, 1], "strides": [8, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_233", "inbound_nodes": [[["re_lu_206", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_12", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_12", "inbound_nodes": [[["re_lu_255", 0, 0, {}], ["conv3d_233", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_158", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 13, 56, 56, 32], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv3d_235_input"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_235", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_225", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_207", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_158", "inbound_nodes": [[["re_lu_206", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_195", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 56, 56, 320], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv3d_290_input"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_290", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_278", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_256", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_195", "inbound_nodes": [[["concatenate_12", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_159", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 13, 56, 56, 16], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv3d_236_input"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_236", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 3, 3], "strides": [1, 2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_226", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_208", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_159", "inbound_nodes": [[["sequential_158", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_196", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 56, 56, 128], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv3d_291_input"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_291", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 3, 3], "strides": [1, 2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_279", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_257", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_196", "inbound_nodes": [[["sequential_195", 1, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_237", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_237", "inbound_nodes": [[["sequential_159", 1, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_292", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_292", "inbound_nodes": [[["sequential_196", 1, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_227", "trainable": true, "dtype": "float32", "axis": [4], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_227", "inbound_nodes": [[["conv3d_237", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_157", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 13, 56, 56, 32], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv3d_234_input"}}, {"class_name": "Conv3D", "config": {"name": 